{"name":"PolyData Electoral Innovation","headerTaglineOne":"Read The Electorate.","headerTaglineTwo":"Understand The World.","headerTaglineThree":"","headerTaglineFour":"Contract-Bound Electoral Technology Solutions.","headerTaglineFive":"Bentonville, Arkansas 💡","showCursor":true,"showBlog":false,"darkMode":false,"showResume":true,"socials":[{"id":"1","title":"LinkedIn","link":"https://www.linkedin.com/in/polydata-innovation/"},{"id":"2","title":"Email","link":"mailto:dineshteja@gmail.com"},{"id":"3","title":"Phone","link":"tel:479-402-1846"}],"testimonials":[{"id":"1","name":"Joshua Price for AR Secretary of State","info":"Little Rock, Arkansas · Political Campaign","testimonial":"Developing B2B Civic Software Product (Early Stage).","imageSrc":"https://wehco.media.clients.ellingtoncms.com/img/photos/2021/07/07/Screen_Shot_2021-07-07_at_12.59.04_PM_t800.png?90232451fbcadccc64a17de7521d859a8f88077d"},{"id":"2","name":"Democrats of Arkansas","info":"Little Rock, Arkansas · Political Organization","testimonial":"Developing B2B Civic Software Product (Early Stage).","imageSrc":"https://arktimes.com/wp-content/uploads/2019/09/arkdems.jpg"},{"id":"3","name":"Arkansas United Community Coalition","info":"Fayetteville, Arkansas · Non-Profit Organization","testimonial":"Developing B2B Civic Software Product (Early Stage).","imageSrc":"https://images.squarespace-cdn.com/content/v1/5b203a03b10598eab318bc71/1535153513012-KFWGLQTUHX3CK4MRTMH1/AU-Logo-vertical-lockup-R99G140B61-1000X1000.jpg"}],"publications":[{"id":"1","title":"CVSS Base Score Prediction Using an Optimized Machine Learning Scheme","dates":"Institute of Electrical and Electronics Engineers (IEEE) · Aug 25, 2023","imageSrc":"https://upload.wikimedia.org/wikipedia/commons/5/56/Ieee_blue.jpg","url":"https://ieeexplore.ieee.org/document/10284627"}],"projects":[{"id":"1","title":"U.S. Election Prediction and Simulation Model","dates":"Machine Learning & Electoral Science","description":"This set of models was primarily developed in conjunction with multiple political campaigns (Joshua Price for AR Secretary of State and Jesse Gibson for AR Att. Gen.).","secondpara":"To predict and simulate various electoral outcomes through these models, federal election datasets from MIT's Election Data + Science Lab (President, Senate, House, etc.) were transformed into entirely numerical formats using LabelEncoders from sci-kit learn. Then, for each separate model, Random Forest Regression, an ensemble learning method that operates by constructing and iterating through multiple decision trees to reach a final prediction, was employed. These Random Forest models were continuously trained with 70% of their respective electoral dataset and tested on their prediction accuracy (via Mean Absolute Error, Mean Squared Error, etc.) using the remaining 30%. Additionally, these models' hyper-parameters (n_estimators, samples, max_features, etc.) were optimized using the Bayesian Optimization algorithm, which employs another predictive machine learning model to repeatedly execute the target model's task (while learning from each result) until the hyper-parameter set that allows for optimal accuracy/error is reached. In this way, we generated models (and accompanying visualizations) that maintained: Less than 5% Error on U.S. Presidential Election Prediction and Historical Election Simulations, Less than 8% Error on U.S. Senate Election Prediction and Historical Election Simulations, Less than 6% Error on U.S. House of Rep Election Prediction and Historical Election Simulations","imageSrc":"/images/electionpred.png","url":""},{"id":"2","title":"Inactive Voter Identification Model","dates":"Machine Learning, NLP, & Generative AI","description":"Developed through an exclusive contract with a political campaign, this model focused on analyzing historical electoral data and current polls to identify demographic groups that will likely be inactive in Arkansas elections.","secondpara":"Since there weren't any official comprehensive datasets with citizens' voting patterns and their demographic information, we merged an existing dataset of demographic information for Arkansas’ towns (via U.S. Census and AR Economic Development Institute) with state election results from 2004-2020 (via Arkansas Secretary of State’s Office) to generate a rough demographic map of Arkansas’ currently active electorate. We also classified all towns in the dataset as active (5), generally active (4), neutral (3), generally inactive (2), or inactive (1) based on their voting percentage. Then, we fed this dataset into a Multilayer Perceptron (MLP) Neural Network, which used a technique called back-propagation to adjust weights of the neurons (layers) in the network to generate more accurate predictions. This MLP was tasked with projecting voting activity (1-5) in the upcoming 2022 state election for all towns in the dataset. In doing so, we found that areas with a dominant Asian-American, specifically Indian and Marshallese-American, population were projected to be the most inactive voter group in the 2022 Arkansas elections. This informed the campaign’s voter outreach strategy and Mr. Price’s future public service endeavors after the conclusion of his campaign.","imageSrc":"/images/joshprice.png","url":""},{"id":"3","title":"AUNow Resources Portal","dates":"Web Development, Visualization, & Database Management","description":"Developed exclusively with Arkansas United, AUNow is Arkansas United’s All-Encompassing Resources Portal. AUNow was made to provide AU staff, volunteers, members, and business partners with access to AU’s most important services and information. ","secondpara":" Constructed with HTML and CSS (Front-End Visuals) along with JavaScript and SQL (Back-End Database Management), AUNow stores information about AU’s various programs in the form of web articles while also hosting a multitude of separate databases for volunteer activity, workforce referrals, and available healthcare professionals. So far, AUNow's informational resources have been published and are currently active on Arkansas United’s website in English and Spanish. We are also in the process of launching AUNow’s various databases online with Google Firebase integration.","imageSrc":"/images/aunow.png","url":""},{"id":"4","title":"Franchise Structure Comparison Model","dates":"Data Analysis, Machine Learning, & Web Development","description":"Developed exclusively with Arkansas United’s Immigrant Resource Center program, this model was created to extract information about non-profit organizations’ and social business’ franchise(e) structures from their websites and use that information to determine the most ideal franchise structure for Arkansas United’s IRC program based on previously specified criteria/keywords.","secondpara":"Using tools from the BeautifulSoup Python library, HTML and XML documents from more than 50 websites from non-profit organizations and businesses were parsed to extract relevant text and store them in a dataset (.csv format). To analyze and understand the collected text data, we employed the BERT Natural Language Processing model (Bidirectional Encoder Representations from Transformers), a unique deep learning model capable of reading and interpreting text in both directions. This bi-directionality, enabled by the use of transformers, allowed it to dynamically calculate weights for different parts of text and generate a more comprehensive understanding of any text document. After applying BERT, we found that the franchise structures of the ‘NAACP’ and ‘Boys & Girls Club’ were most suitable for Arkansas United’s IRC program requirements, which we essentially input to the model through keywords and additional literature. Using the results of PolyData’s Franchise Structure Comparison Model, Arkansas United designed and launched their optimized IRC program with an improved application process, management structure, franchisee requirements, etc.","imageSrc":"/images/aulogo.png","url":""},{"id":"5","title":"Demographic Electoral Data Report Generator","dates":"Database Management, Machine Learning & Web Development","description":"Developed exclusively with Arkansas United and the Democratic Party of Arkansas, this AI-based generator was constructed to generate electoral data reports (basic statistics, understandable visualizations, relevant trend analysis, etc.) that display demographic differences and information. ","secondpara":"This resource is designed to be a more interactive software tool. When users upload a dataset (.csv format), descriptive statistics (means, standard deviation, quartiles, counts, percentages, etc.) are calculated and, to complement these statistics, visualizations (distributions, venn-diagrams, etc.) are also generated. In addition to descriptive statistics, a set of predictive analytics are also conducted, including electoral forecasting and demographic-specific voting pattern prediction. These operations are made possible through classification and regression-oriented machine learning models from scikit-learn integrated into this software. By automatically generating descriptive statistics and predictive analytics for any electoral dataset, this generator allows non-profit organizations and social businesses to more efficiently analyze and understand convoluted datasets.","imageSrc":"/images/arkdems.jpg","url":""}],"partners":[{"id":"1","title":"Democratic Party of Arkansas","imageSrc":"https://arktimes.com/wp-content/uploads/2019/09/arkdems.jpg"},{"id":"2","title":"Leukemia and Lymphoma Society","imageSrc":"https://larsonhomeservices.com/wp-content/uploads/2022/04/featured_LLS-1.jpeg"},{"id":"3","title":"Arkansas United","imageSrc":"https://images.squarespace-cdn.com/content/v1/5b203a03b10598eab318bc71/1535153513012-KFWGLQTUHX3CK4MRTMH1/AU-Logo-vertical-lockup-R99G140B61-1000X1000.jpg"}],"services":[{"id":"1","title":"Election Simulations and Forecasting.","description":"We research, analyze, and breakdown all sorts of elections to develop efficient simulations that provide actionable insights."},{"id":"2","title":"Campaign Optimization Tools.","description":"We focus on creating usable election analysis, data management, and operation handling tools to propel political campaigns to a new level. "},{"id":"3","title":"Political Activism and Volunteering.","description":"We enable today's youth to engage with society through activism and volunteering opportunities that impact thousands. "},{"id":"4","title":"Centralized Election Data.","description":"We work with local, state, and federal government entities to assemble usable and informational datasets of election trends. "}],"aboutpara":"The PolyData Electoral Innovation Network is a pioneering non-profit initiative that provides an array of artificial intelligence-enhanced election analysis tools and software solutions. Developed exclusively through strategic short-term contracts with political campaigns, activist organizations, and governmental bodies, our suite of products is crafted to bolster the efficiency and efficacy of these groups in serving their constituents. Each tool is the result of intensive collaboration, designed to meet the pressing needs of our partners in the political arena.","aboutparasecond":"Our network's contributions extend from sophisticated electoral forecasting models to intuitive data visualization interfaces, all aimed at distilling complex electoral data into clear, actionable strategies. By engaging with a spectrum of political entities on focused projects, PolyData ensures that each product not only leverages the latest in AI technology but also aligns closely with the dynamic requirements of modern political and social campaigns. This approach reinforces our dedication to electoral innovation, offering our partners bespoke tools that are both impactful and instrumental in fostering a more informed, proactive, and engaged electorate.","resume":{"tagline":"Harvard University | Software Engineering | Data Science","description":"Bentonville, AR • dineshvasireddy@college.harvard.edu • (479) 402-1846 • https://www.linkedin.com/in/dinesh-vasireddy/","experiences":[{"id":"1","dates":"Oct. 2023 - Present","type":"Contract","position":"Data Scientist @ Harvard Undergraduate Data Analytics Group","bullets":"Collaborated on a Data Science-focused consulting project for a subsidiary of large Fortune 500 US-based aviation client. Employing advanced statistical methods, including Monte Carlo Risk Analysis, Market Segmentation Modelling, in Python/ R to analyze high-volume datasets and predict market risks, trends, and generate business recommendations to improve high-value sales channels ($20M Valuation). "},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Sep. 2023 - Dec. 2023","type":"Contract","position":"Software Engineer @ Change Climate Project","bullets":"Worked with a Case Team of Harvard Tech for Social Good SWEs to develop a Generative AI tool (Used by 347 Global Brands, Continues Carbon Offsetting of 1.3M+ Tonnes) focused on generating more comprehensive sustainability plans for governmental organizations, non-profit groups, and international companies. "},{"id":"5804c496-3e2f-47ec-97ff-d7a3935c6895","dates":"Oct. 2022 - Jun. 2023","type":"Full Time","position":"Software Engineering Consultant @ Arkansas United","bullets":"Developed and launched an online automated resources portal AUNow (2K+ National Users, 10+ Partners, 50K Visits, Largest in Arkansas). Created machine learning models for electoral analysis and social media listening to develop optimized technology-related policy proposals, most notably for statewide race and ethnicity data tracking (Presented to Governor Asa Hutchinson)."},{"id":"d00b0dc0-b252-4863-92d9-06318241ce78","dates":"Jun. 2022 - Sep. 2022","type":"Internship","position":"Data Science & AI/ML Intern @ Datategy NextGen AI Solutions","bullets":"Developed, optimized, and deployed three new machine learning algorithms, focused on financial analysis and data management, for Datategy’s PapAI Business AI Platform (20+ International Clients, $3.6M Valuation) and contributed to company-wide strategy development for business outreach, industry expansion, and feature creation."},{"id":"092a463d-7800-4086-9c50-283966e89eb4","dates":"Sep. 2021 - May 2022","type":"Internship","position":"Software Engineering & Data Science Intern @ Walmart Global Tech.","bullets":"Created and deployed a global E-Commerce Demand Forecasting Model (80% Accuracy, Used by 152K Merchants, Impacts 300M+ Users, Optimized Sales for 6.5M+ Products) of Walmart.com sales to optimize online Apparel sales; Developed effective sales strategies that compete with other retailers using advanced predictive analytics. "},{"id":"e822e1ad-35e1-4628-9e33-509a356b9ee3","dates":"Apr. 2021 - Jun. 2023","type":"Full Time","position":"AI/ML Research Assistant and Investigator @ SEEDS Center","bullets":"Conducted and led NSF-sponsored research advised by Prof. Qinghua Li at UARK’s Cybersecurity Center for Secure Evolvable Energy Delivery Systems (SEEDS) investigating the use of language learning models and machine learning algorithms (Doc2Vec, Fast.ai, Advanced BERT Models) to improve the Common Vulnerability Scoring System and effectively classify computer system vulnerabilities. Accepted for publication by TechConnect for Resilience Week 2023 in Washington D.C."}],"education":{"universityName":"Harvard University","universityDate":"2023-2027","universityPara":"Bachelor's in Computer Science and Government | Harvard Innovation Labs (Test), HCS Tech for Social Good (SWE), Harvard Data Analytics Group (Analyst)"},"languages":["Javascript","HTML5","CSS","Python","Go","Java","C++","R"],"frameworks":["MERN Stack (MongoDB, React.js, Express.js, Node.js)","TensorFlow","PyTorch","Amazon Web Services (AWS)","Google Cloud Platform (GCP)","Fast.ai"],"others":["Political Software","Market Analysis","Sales Optimization","Translation Software","Government Operations","Fundraising Software","Social Listening Technologies"]}}