{"name":"Dinesh Vasireddy","headerTaglineOne":"Hello 🚀","headerTaglineTwo":"I'm Dinesh Vasireddy - an","headerTaglineThree":"aspiring software engineer","headerTaglineFour":"Computer Science, Government, and Statistics @ Harvard","headerTaglineFive":"Bentonville, AR & Cambridge, MA","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/DineshTeja"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/dinesh-vasireddy/"},{"id":"3","title":"Twitter","link":"https://twitter.com/VasireddyDinesh"},{"id":"4","title":"Email","link":"mailto:dineshvasireddy@college.harvard.edu"}],"involvements":[{"id":"1","title":"Something New @ Harvard Innovation Labs","dates":"Dec. 2024 - Present","description":"Developing B2B Civic Software Product (Early Stage).","imageSrc":"https://cdnassets.hw.net/ec/e2/d0013b8e4f6eb92a5d7da9d786d6/f339746cb2bb4e3db3cea73af7ccd336.jpg"}],"publications":[{"id":"1","title":"CVSS Base Score Prediction Using an Optimized Machine Learning Scheme","dates":"Institute of Electrical and Electronics Engineers (IEEE) · Aug 25, 2023","imageSrc":"https://upload.wikimedia.org/wikipedia/commons/5/56/Ieee_blue.jpg","url":"https://ieeexplore.ieee.org/document/10284627"}],"projects":[{"id":"1","title":"PolyData Electoral Innovation","dates":"Machine Learning, Web Development, & Political Science · Oct. 2022 - Aug. 2023","description":"Developed and distributed a collection of contract-bound AI-driven election analysis models focused on optimizing political campaign operations, interpreting electoral outcomes, and understanding voter behavior in local, state, and federal elections. Notable Client Contract Projects: Voter Pulse: Inactive Voter Identification Model (Acquired by 8 Campaigns), Electoral Report Generator (Acquired by 4 Campaigns & Government Offices), Immigrant Resources Portal (2K Users in Arkansas), Federal Election Simulations (Presented to 10+ State Politicians), etc. ","imageSrc":"https://www.polydataelect.org/uploads/1/0/5/7/105732197/published/dall-e-2024-01-02-14-06-23-create-a-minimalist-icon-for-electoral-analytics-using-only-a-black-silhouette-of-a-ballot-box-with-a-check-mark-inside-it-set-against-a-solid-yello.png?1704226432","url":"https://www.polydataelect.org/"},{"id":"2","title":"AnyCheck","dates":"Web Development, NLP, & Generative AI  · Dec. 2023 - Jan. 2024","description":"Developed a web application utilizing a custom-trained large language model enhanced via relevant news articles, integrated speech recognition, and real-time analytical feedback, designed to enhance information accuracy through voice-activated claims submission and comprehensive PDF essay analysis. ","imageSrc":"https://about.fb.com/wp-content/uploads/2018/12/FactCheckers_Thumbnail_Final.jpg?w=1200","url":"https://github.com/DineshTeja/AnyCheck"},{"id":"3","title":"CinemaFuture","dates":"Data Science, Visualization, & Machine Learning · Jan. 2024 - Present","description":"Developed a machine learning application that combines extensive data analysis from IMDb, Box Office Mojo, and TMDb, sophisticated feature engineering, and advanced machine learning models including sentiment analysis from Instagram and YouTube Trailer comments, to forecast film success and provide data-driven insights into the lifecycle of upcoming films in Hollywood. ","imageSrc":"https://www.thesmartcube.com/app/uploads/2021/11/DW-Blog-2-image-4-shutterstock_1132760195.jpg","url":""}],"services":[{"id":"1","title":"Art Direction","description":"We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."},{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"I am a passionate and curious student of Computer Science and Government at Harvard University, aiming to use my skills in technology solutions, software engineering, and data analytics to create civic software that can improve the lives of people and communities. I have demonstrated internship experience across a variety of companies (Walmart Global Tech, Datategy) and non-profit organizations (Arkansas United, Political Campaigns). I've also developed various projects focusing on civic software, web development, machine learning, and data science. Currently, I am involved in developing various civic software products and services with a primary focus on electoral analytics and campaign optimization.","resume":{"tagline":"Harvard University | Software Engineering | Data Science","description":"Bentonville, AR • dineshvasireddy@college.harvard.edu • (479) 402-1846 • https://www.linkedin.com/in/dinesh-vasireddy/","experiences":[{"id":"1","dates":"Oct. 2023 - Present","type":"Contract","position":"Data Scientist @ Harvard Undergraduate Data Analytics Group","bullets":"Collaborated on a Data Science-focused consulting project for a subsidiary of large Fortune 500 US-based aviation client. Employing advanced statistical methods, including Monte Carlo Risk Analysis, Market Segmentation Modelling, in Python/ R to analyze high-volume datasets and predict market risks, trends, and generate business recommendations to improve high-value sales channels ($20M Valuation). "},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Sep. 2023 - Dec. 2023","type":"Contract","position":"Software Engineer @ Change Climate Project","bullets":"Worked with a Case Team of Harvard Tech for Social Good SWEs to develop a Generative AI tool (Used by 347 Global Brands, Continues Carbon Offsetting of 1.3M+ Tonnes) focused on generating more comprehensive sustainability plans for governmental organizations, non-profit groups, and international companies. "},{"id":"5804c496-3e2f-47ec-97ff-d7a3935c6895","dates":"Oct. 2022 - Jun. 2023","type":"Full Time","position":"Software Engineering Consultant @ Arkansas United","bullets":"Developed and launched an online automated resources portal AUNow (2K+ National Users, 10+ Partners, 50K Visits, Largest in Arkansas). Created machine learning models for electoral analysis and social media listening to develop optimized technology-related policy proposals, most notably for statewide race and ethnicity data tracking (Presented to Governor Asa Hutchinson)."},{"id":"d00b0dc0-b252-4863-92d9-06318241ce78","dates":"Jun. 2022 - Sep. 2022","type":"Internship","position":"Data Science & AI/ML Intern @ Datategy NextGen AI Solutions","bullets":"Developed, optimized, and deployed three new machine learning algorithms, focused on financial analysis and data management, for Datategy’s PapAI Business AI Platform (20+ International Clients, $3.6M Valuation) and contributed to company-wide strategy development for business outreach, industry expansion, and feature creation."},{"id":"092a463d-7800-4086-9c50-283966e89eb4","dates":"Sep. 2021 - May 2022","type":"Internship","position":"Software Engineering & Data Science Intern @ Walmart Global Tech.","bullets":"Created and deployed a global E-Commerce Demand Forecasting Model (80% Accuracy, Used by 152K Merchants, Impacts 300M+ Users, Optimized Sales for 6.5M+ Products) of Walmart.com sales to optimize online Apparel sales; Developed effective sales strategies that compete with other retailers using advanced predictive analytics. "},{"id":"e822e1ad-35e1-4628-9e33-509a356b9ee3","dates":"Apr. 2021 - Jun. 2023","type":"Full Time","position":"AI/ML Research Assistant and Investigator @ SEEDS Center","bullets":"Conducted and led NSF-sponsored research advised by Prof. Qinghua Li at UARK’s Cybersecurity Center for Secure Evolvable Energy Delivery Systems (SEEDS) investigating the use of language learning models and machine learning algorithms (Doc2Vec, Fast.ai, Advanced BERT Models) to improve the Common Vulnerability Scoring System and effectively classify computer system vulnerabilities. Accepted for publication by TechConnect for Resilience Week 2023 in Washington D.C."}],"education":{"universityName":"Harvard University","universityDate":"2023-2027","universityPara":"Bachelor's in Computer Science and Government | Harvard Innovation Labs (Test), HCS Tech for Social Good (SWE), Harvard Data Analytics Group (Analyst)"},"languages":["Javascript","HTML5","CSS","Python","Go","Java","C++","R"],"frameworks":["MERN Stack (MongoDB, React.js, Express.js, Node.js)","TensorFlow","PyTorch","Amazon Web Services (AWS)","Google Cloud Platform (GCP)","Fast.ai"],"others":["Political Software","Market Analysis","Sales Optimization","Translation Software","Government Operations","Fundraising Software","Social Listening Technologies"]}}